In [10]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
titanic = sns.load_dataset('titanic')
titanic.shape
titanic.head() # affiche la tete de la dataset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
titanic = titanic[['survived', 'pclass', 'sex', 'age']]
titanic.dropna(axis=0, inplace=True) # Supprimer tt les lignes qui contient NULL
titanic['sex'].replace(['male', 'female'], [0, 1], inplace=True)
titanic.head()

   survived  pclass  sex   age
0         0       3    0  22.0
1         1       1    1  38.0
2         1       3    1  26.0
3         1       1    1  35.0
4         0       3    0  35.0

In [4]:
from sklearn.neighbors import KNeighborsClassifier

In [5]:
model = KNeighborsClassifier()

In [6]:
Y = titanic['survived'] #selectionner juste la colonne 0
X = titanic.drop('survived', axis=1) #supprimmer la colonne survived de X

In [7]:
model.fit(X, Y)
model.score(X, Y)

0.8319327731092437

In [29]:
def survie(model, pclass, sex, age):
    x = np.array([pclass, sex, age]).reshape(1, 3)
    if model.predict(x) == 1:
        print("le voyageur sera mort")
    else:
        print("le voyageur sera vivant")
    print("avec une probabilité",model.predict_proba(x))

In [30]:
#0:male; 1: female
survie(model, 2, 1, 50)
#resultal:0 ----> mort; resultal:1 ---->vivre

le voyageur sera mort
avec une probabilité [[0.2 0.8]]